_posts/2013-05-19-Redirecting-the-print-function.html
---
title: Redirecting the print function
date: 2013/05/19 11:19:36
updated: 2013/05/29 20:17:48
categories: programming
tags: 
---


<p>
Ordinarily a print statement prints to stdout, or your terminal/screen. You can redirect this so that printing is done to a file, for example. This might be helpful if you use print statements for debugging, and later want to save what is printed to a file. Here we make a simple function that prints some things.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">def</span> <span style="color: #8b2323;">debug</span>():
    <span style="color: #8b0000;">print</span> <span style="color: #228b22;">'step 1'</span>
    <span style="color: #8b0000;">print</span> 3 + 4
    <span style="color: #8b0000;">print</span> <span style="color: #228b22;">'finished'</span>

debug()
</pre>
</div>

<pre class="example">
... ... ... &gt;&gt;&gt; step 1
7
finished
</pre>

<p>
Now, let us redirect the printed lines to a file. We create a file object, and set sys.stdout equal to that file object.
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">import</span> sys
<span style="color: #8b0000;">print</span> &gt;&gt; sys.__stdout__, <span style="color: #228b22;">'__stdout__ before = '</span>, sys.__stdout__
<span style="color: #8b0000;">print</span> &gt;&gt; sys.__stdout__, <span style="color: #228b22;">'stdout before = '</span>, sys.stdout

f = <span style="color: #8b0000;">open</span>(<span style="color: #228b22;">'data/debug.txt'</span>, <span style="color: #228b22;">'w'</span>)
sys.stdout = f

<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">note that sys.__stdout__ does not change, but stdout does.</span>
<span style="color: #8b0000;">print</span> &gt;&gt; sys.__stdout__, <span style="color: #228b22;">'__stdout__ after = '</span>, sys.__stdout__
<span style="color: #8b0000;">print</span> &gt;&gt; sys.__stdout__, <span style="color: #228b22;">'stdout after = '</span>, sys.stdout

debug()

<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">reset stdout back to console</span>
sys.stdout = sys.__stdout__

<span style="color: #8b0000;">print</span> f
f.close() <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">try to make it a habit to close files</span>
<span style="color: #8b0000;">print</span> f
</pre>
</div>

<pre class="example">
__stdout__ before =  &lt;open file '&lt;stdout&gt;', mode 'w' at 0x2ae7d70e01e0&gt;
stdout before =  &lt;open file '&lt;stdout&gt;', mode 'w' at 0x2ae7d70e01e0&gt;
&gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; ... __stdout__ after =  &lt;open file '&lt;stdout&gt;', mode 'w' at 0x2ae7d70e01e0&gt;
stdout after =  &lt;open file 'data/debug.txt', mode 'w' at 0x2ae7dbcbbb70&gt;
&gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; ... &gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; &lt;open file 'data/debug.txt', mode 'w' at 0x2ae7dbcbbb70&gt;
&gt;&gt;&gt; &lt;closed file 'data/debug.txt', mode 'w' at 0x2ae7dbcbbb70&gt;
</pre>

<p>
Note it can be important to close files. If you are looping through large numbers of files, you will eventually run out of file handles, causing an error. We can use a context manager to automatically close the file like this
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">import</span> sys

<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">use the open context manager to automatically close the file</span>
<span style="color: #8b0000;">with</span> <span style="color: #8b0000;">open</span>(<span style="color: #228b22;">'data/debug.txt'</span>, <span style="color: #228b22;">'w'</span>) <span style="color: #8b0000;">as</span> f:
    sys.stdout = f
    debug()
    <span style="color: #8b0000;">print</span> &gt;&gt; sys.__stdout__, f

<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">reset stdout</span>
sys.stdout = sys.__stdout__
<span style="color: #8b0000;">print</span> f
</pre>
</div>

<pre class="example">
&gt;&gt;&gt; ... ... ... ... ... &lt;open file 'data/debug.txt', mode 'w' at 0x0000000002071C00&gt;
... &gt;&gt;&gt; &lt;closed file 'data/debug.txt', mode 'w' at 0x0000000002071C00&gt;
</pre>

<p>
See, the file is closed for us! We can see the contents of our file like this.
</p>
<div class="org-src-container">

<pre class="src src-sh">cat data/debug.txt
</pre>
</div>

<pre class="example">
step 1
7
finished
</pre>

<p>
The approaches above are not fault safe. Suppose our debug function raised an exception. Then, it could be possible the line to reset the stdout would not be executed. We can solve this with try/finally code.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">import</span> sys

<span style="color: #8b0000;">print</span> <span style="color: #228b22;">'before: '</span>, sys.stdout
<span style="color: #8b0000;">try:</span>
    <span style="color: #8b0000;">with</span> <span style="color: #8b0000;">open</span>(<span style="color: #228b22;">'data/debug-2.txt'</span>, <span style="color: #228b22;">'w'</span>) <span style="color: #8b0000;">as</span> f:
        sys.stdout = f
        <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">print to the original stdout</span>
        <span style="color: #8b0000;">print</span> &gt;&gt; sys.__stdout__, <span style="color: #228b22;">'during: '</span>, sys.stdout
        debug()
        <span style="color: #8b0000;">raise</span> <span style="color: #cd0000;">Exception</span>(<span style="color: #228b22;">'something bad happened'</span>)
<span style="color: #8b0000;">finally:</span>
    <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">reset stdout</span>
    sys.stdout = sys.__stdout__

<span style="color: #8b0000;">print</span> <span style="color: #228b22;">'after: '</span>, sys.stdout
<span style="color: #8b0000;">print</span> f <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">verify it is closed</span>
<span style="color: #8b0000;">print</span> sys.stdout <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">verify this is reset</span>
</pre>
</div>

<pre class="example">
&gt;&gt;&gt; before:  &lt;open file '&lt;stdout&gt;', mode 'w' at 0x2ae7d70e01e0&gt;
... ... ... ... ... ... ... ... ... ... during:  &lt;open file 'data/debug-2.txt', mode 'w' at 0x2ae7dbcbbf60&gt;
Traceback (most recent call last):
  File "&lt;stdin&gt;", line 7, in &lt;module&gt;
Exception: something bad happened
after:  &lt;open file '&lt;stdout&gt;', mode 'w' at 0x2ae7d70e01e0&gt;
&lt;closed file 'data/debug-2.txt', mode 'w' at 0x2ae7dbcbbf60&gt;
&lt;open file '&lt;stdout&gt;', mode 'w' at 0x2ae7d70e01e0&gt;
</pre>

<div class="org-src-container">

<pre class="src src-sh">cat data/debug-2.txt
</pre>
</div>

<pre class="example">
step 1
7
finished
</pre>

<p>
This is the kind of situation where a context manager is handy. Context managers are typically a class that executes some code when you &ldquo;enter&rdquo; the context, and then execute some code when you &ldquo;exit&rdquo; the context. Here we want to change sys.stdout to a new value inside our context, and change it back when we exit the context. We will store the value of sys.stdout going in, and restore it on the way out.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">import</span> sys

<span style="color: #8b0000;">class</span> <span style="color: #4682b4;">redirect</span>:
    <span style="color: #8b0000;">def</span> <span style="color: #8b2323;">__init__</span>(<span style="color: #8b0000;">self</span>, f=sys.stdout):
        <span style="color: #228b22;">"redirect print statement to f. f must be a file-like object"</span>
        <span style="color: #8b0000;">self</span>.f = f
        <span style="color: #8b0000;">self</span>.stdout = sys.stdout
        <span style="color: #8b0000;">print</span> &gt;&gt; sys.__stdout__, <span style="color: #228b22;">'init stdout: '</span>, sys.stdout        
    <span style="color: #8b0000;">def</span> <span style="color: #8b2323;">__enter__</span>(<span style="color: #8b0000;">self</span>): 
        sys.stdout = <span style="color: #8b0000;">self</span>.f
        <span style="color: #8b0000;">print</span> &gt;&gt; sys.__stdout__,  <span style="color: #228b22;">'stdout in context-manager: '</span>,sys.stdout
    <span style="color: #8b0000;">def</span> <span style="color: #8b2323;">__exit__</span>(<span style="color: #8b0000;">self</span>, *args):
        sys.stdout = <span style="color: #8b0000;">self</span>.stdout
        <span style="color: #8b0000;">print</span> <span style="color: #228b22;">'__stdout__ at exit = '</span>,sys.__stdout__        

<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">regular printing</span>
<span style="color: #8b0000;">with</span> redirect():
    debug()

<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">write to a file</span>
<span style="color: #8b0000;">with</span> <span style="color: #8b0000;">open</span>(<span style="color: #228b22;">'data/debug-3.txt'</span>, <span style="color: #228b22;">'w'</span>) <span style="color: #8b0000;">as</span> f:
    <span style="color: #8b0000;">with</span> redirect(f):
        debug()

<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">mixed regular and </span>
<span style="color: #8b0000;">with</span> <span style="color: #8b0000;">open</span>(<span style="color: #228b22;">'data/debug-4.txt'</span>, <span style="color: #228b22;">'w'</span>) <span style="color: #8b0000;">as</span> f:
    <span style="color: #8b0000;">with</span> redirect(f):
        <span style="color: #8b0000;">print</span> <span style="color: #228b22;">'testing redirect'</span>
        <span style="color: #8b0000;">with</span> redirect():
            <span style="color: #8b0000;">print</span> <span style="color: #228b22;">'temporary console printing'</span>
            debug()
        <span style="color: #8b0000;">print</span> <span style="color: #228b22;">'Now outside the inner context. this should go to data/debug-4.txt'</span>
        debug()
        <span style="color: #8b0000;">raise</span> <span style="color: #cd0000;">Exception</span>(<span style="color: #228b22;">'something else bad happened'</span>)

<span style="color: #8b0000;">print</span> sys.stdout
</pre>
</div>

<pre class="example">
&gt;&gt;&gt; ... ... ... ... ... ... ... ... ... ... ... ... &gt;&gt;&gt; ... ... ... init stdout:  &lt;open file '&lt;stdout&gt;', mode 'w' at 0x2ae7d70e01e0&gt;
stdout in context-manager:  &lt;open file '&lt;stdout&gt;', mode 'w' at 0x2ae7d70e01e0&gt;
step 1
7
finished
__stdout__ at exit =  &lt;open file '&lt;stdout&gt;', mode 'w' at 0x2ae7d70e01e0&gt;
... ... ... ... init stdout:  &lt;open file '&lt;stdout&gt;', mode 'w' at 0x2ae7d70e01e0&gt;
stdout in context-manager:  &lt;open file 'data/debug-3.txt', mode 'w' at 0x2ae7dbcbbb70&gt;
__stdout__ at exit =  &lt;open file '&lt;stdout&gt;', mode 'w' at 0x2ae7d70e01e0&gt;
... ... ... ... ... ... ... ... ... ... init stdout:  &lt;open file '&lt;stdout&gt;', mode 'w' at 0x2ae7d70e01e0&gt;
stdout in context-manager:  &lt;open file 'data/debug-4.txt', mode 'w' at 0x2ae7dca4d030&gt;
init stdout:  &lt;open file 'data/debug-4.txt', mode 'w' at 0x2ae7dca4d030&gt;
stdout in context-manager:  &lt;open file '&lt;stdout&gt;', mode 'w' at 0x2ae7d70e01e0&gt;
temporary console printing
step 1
7
finished
__stdout__ at exit =  &lt;open file '&lt;stdout&gt;', mode 'w' at 0x2ae7d70e01e0&gt;
Traceback (most recent call last):
  File "&lt;stdin&gt;", line 10, in &lt;module&gt;
Exception: something else bad happened
&lt;open file '&lt;stdout&gt;', mode 'w' at 0x2ae7d70e01e0&gt;
</pre>

<p>
Here are the contents of the debug file. 
</p>
<div class="org-src-container">

<pre class="src src-sh">cat data/debug-3.txt
</pre>
</div>

<pre class="example">
step 1
7
finished
</pre>

<p>
The contents of the other debug file have some additional lines, because we printed some things while in the redirect context.
</p>
<div class="org-src-container">

<pre class="src src-sh">cat data/debug-4.txt
</pre>
</div>

<pre class="example">
testing redirect
__stdout__ at exit =  &lt;open file '&lt;stdout&gt;', mode 'w' at 0x2ae7d70e01e0&gt;
Now outside the inner context. this should go to data/debug-4.txt
step 1
7
finished
</pre>

<p>
See <a href="http://www.python.org/dev/peps/pep-0343/" >http://www.python.org/dev/peps/pep-0343/</a> (number 5) for another example of redirecting using a function decorator. I think it is harder to understand, because it uses a generator.
</p>

<p>
There were a couple of points in this section:
</p>

<ol>
<li>You can control where things are printed in your programs by modifying the value of sys.stdout
</li>
<li>You can use try/except/finally blocks to make sure code gets executed in the event an exception is raised
</li>
<li>You can use context managers to make sure files get closed, and code gets executed if exceptions are raised.
</li>
</ol>
<p>Copyright (C) 2013 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2013/05/19/Redirecting-the-print-function.org">org-mode source</a><p>